; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	infrared6 - mode
	spectrograph7 - mode
	image9 - mode
	spectrograph1 - mode
	image3 - mode
	thermograph0 - mode
	image4 - mode
	infrared8 - mode
	spectrograph2 - mode
	spectrograph5 - mode
	GroundStation1 - direction
	Star5 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation0 - direction
	Star4 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 image9)
	(supports instrument0 infrared6)
	(supports instrument0 image4)
	(supports instrument0 infrared8)
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph7)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 thermograph0)
	(supports instrument1 image4)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 spectrograph5)
	(supports instrument2 image3)
	(supports instrument2 image9)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
)
(:goal (and
	(pointing satellite0 Planet8)
	(pointing satellite1 Star4)
	(have_image Planet6 image4)
	(have_image Planet6 spectrograph7)
	(have_image Star7 image4)
	(have_image Star7 spectrograph1)
	(have_image Planet8 infrared8)
	(have_image Planet8 spectrograph1)
	(have_image Planet9 image3)
	(have_image Planet9 spectrograph7)
	(have_image Planet9 image9)
	(have_image Star10 image3)
	(have_image Star10 spectrograph1)
	(have_image Phenomenon11 spectrograph7)
	(have_image Phenomenon11 infrared8)
))

)

; plan
1. (turn_to satellite1 groundstation0 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 15
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 15
3. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 0 of 15
4. (turn_to satellite1 star10 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star10)
   goals met: 0 of 15
5. (take_image satellite1 star10 instrument2 image3)
   added: (have_image star10 image3)
   goals met: 1 of 15
6. (turn_to satellite1 planet9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet9)
   goals met: 1 of 15
7. (take_image satellite1 planet9 instrument2 image9)
   added: (have_image planet9 image9)
   goals met: 2 of 15
8. (take_image satellite1 planet9 instrument2 image3)
   added: (have_image planet9 image3)
   goals met: 3 of 15
9. (turn_to satellite1 star4 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star4)
   goals met: 4 of 15
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 15
11. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 4 of 15
12. (turn_to satellite0 phenomenon11 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 15
13. (take_image satellite0 phenomenon11 instrument0 infrared8)
   added: (have_image phenomenon11 infrared8)
   goals met: 5 of 15
14. (take_image satellite0 phenomenon11 instrument0 spectrograph7)
   added: (have_image phenomenon11 spectrograph7)
   goals met: 6 of 15
15. (turn_to satellite0 planet6 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet6)
   goals met: 6 of 15
16. (take_image satellite0 planet6 instrument0 image4)
   added: (have_image planet6 image4)
   goals met: 7 of 15
17. (take_image satellite0 planet6 instrument0 spectrograph7)
   added: (have_image planet6 spectrograph7)
   goals met: 8 of 15
18. (turn_to satellite0 planet9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet9)
   goals met: 8 of 15
19. (take_image satellite0 planet9 instrument0 spectrograph7)
   added: (have_image planet9 spectrograph7)
   goals met: 9 of 15
20. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 9 of 15
21. (take_image satellite0 star10 instrument0 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 10 of 15
22. (turn_to satellite0 star7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star7)
   goals met: 10 of 15
23. (take_image satellite0 star7 instrument0 image4)
   added: (have_image star7 image4)
   goals met: 11 of 15
24. (take_image satellite0 star7 instrument0 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 12 of 15
25. (turn_to satellite0 planet8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet8)
   goals met: 13 of 15
26. (take_image satellite0 planet8 instrument0 infrared8)
   added: (have_image planet8 infrared8)
   goals met: 14 of 15
27. (take_image satellite0 planet8 instrument0 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 15 of 15
